Autodesk.Revit.DB.GlobalParametersManager.ShouldHandleGlobalParameters(Autodesk.Revit.DB.Document)
For performance reasons sometimes we don't want to handle Global Parameters processing
when there are no Global Parameters in the project.
Returns:
True if Global Parameters are allowed and there is at least one global parameter in the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update